var ctx = document.getElementById("myChart");
var myChart = new Chart(ctx, {
  //線グラフ
  type: "line",
  //データ
  data: {
    //各データの時間
    labels: ['00:00', '00:15', '00:30', '00:45', '01:00', '01:15', '01:30', '01:45', '02:00', '02:15', '02:30', '02:45', '03:00', '03:15', '03:30', '03:45', '04:00', '04:15', '04:30', '04:45', '05:00', '05:15', '05:30', '05:45', '06:00', '06:15', '06:30', '06:45', '07:00', '07:15', '07:30', '07:45', '08:00', '08:15', '08:30', '08:45', '09:00', '09:15', '09:30', '09:45', '10:00', '10:15', '10:30', '10:45', '11:00', '11:15', '11:30', '11:45', '12:00', '12:15', '12:30', '12:45', '13:00', '13:15', '13:30', '13:45', '14:00', '14:15', '14:30', '14:45', '15:00', '15:15', '15:30', '15:45', '16:00', '16:15', '16:30', '16:45', '17:00', '17:15', '17:30', '17:45', '18:00', '18:15', '18:30', '18:45', '19:00', '19:15', '19:30', '19:45', '20:00', '20:15', '20:30', '20:45', '21:00', '21:15', '21:30', '21:45', '22:00', '22:15', '22:30', '22:45', '23:00', '23:15', '23:30', '23:45'],
    //データセット
    datasets: [
      {
        label: "反応回数",
        data: [35.6, 35.8, 36.1, 35.5, 35.8, 36.0],
        borderColor: "rgba(255, 99, 132, 1)", //線の色
        backgroundColor: "rgba(255, 99, 132, 0.1)" //塗りつぶしの色
      }
    ]
  },
  //グラフ設定
  options: {
    //凡例は非表示
    legend: {
      display: false
    },
    scales: {
      //X軸
      xAxes: [
        {
          //軸ラベル表示
          scaleLabel: {
            display: true,
            labelString: "時間"
          },
          //ここで軸を時間を設定する
          type: "time",
          time: {
            parser: "hh:mm",
            unit: "hour",
            stepSize: 1,
            displayFormats: {
              hour: "HH:mm"
            }
          },
          //X軸の範囲を指定
          ticks: {
            min: "09:00",
            max: "20:00"
          }
        }
      ],
      //Y軸
      yAxes: [
        {
          //軸ラベル表示
          scaleLabel: {
            display: true,
            labelString: "体温"
          },
          //Y軸の範囲を指定
          ticks: {
            min: 34.0,
            max: 38.0
          }
        }
      ]
    }
  }
});

//0:00〜23:59
function onButton24() {
  myChart.options.scales.xAxes[0].ticks.min = "0:00";
  myChart.options.scales.xAxes[0].ticks.max = "23:59";
  myChart.update();
}

//9:00〜20:00
function onButton() {
  myChart.options.scales.xAxes[0].ticks.min = "09:00";
  myChart.options.scales.xAxes[0].ticks.max = "20:00";
  myChart.update();
}